{"data":[{"page":{"entry":{"name":"xcode","filename":"xcode.md","absolute":"/Users/gilbertsinnott/Code/openFrameworks/ofSite/content/setup/xcode.md","path":"/guides/xcode","route":"/guides/xcode.md","dir":"../ofSite/content/setup","ext":"md","type":"page","id":33,"parent":3,"breadcrumbs":[3],"siblings":[],"translations":{"ja":{"name":"xcode-ja","filename":"xcode.ja.md","absolute":"/Users/gilbertsinnott/Code/openFrameworks/ofSite/content/setup/xcode.ja.md","path":"/guides/xcode-ja","route":"/guides/xcode.ja.md","dir":"../ofSite/content/setup","ext":"md","type":"page","id":31,"parent":3,"breadcrumbs":[3],"siblings":[],"translations":{}},"ko":{"name":"xcode-ko","filename":"xcode.ko.md","absolute":"/Users/gilbertsinnott/Code/openFrameworks/ofSite/content/setup/xcode.ko.md","path":"/guides/xcode-ko","route":"/guides/xcode.ko.md","dir":"../ofSite/content/setup","ext":"md","type":"page","id":32,"parent":3,"breadcrumbs":[3],"siblings":[],"translations":{}}}},"description":{},"document":"<h2>-<em>- coding: utf-8 -</em>-</h2>\n<p>.. title: xcode</p>\n<h1>Xcode Setup Guide</h1>\n<h2>First Steps</h2>\n<ol>\n<li>Install Xcode from the <a href=\"https://itunes.apple.com/ca/app/xcode/id497799835?mt=12\">OSX App Store</a></li>\n<li>Install Xcode's command line tools</li>\n</ol>\n<p>To install the command line tools, first finish installing Xcode then open up a terminal (you can find it at Applications/Utilities/Terminal.app), type the following and hit enter:</p>\n<pre><code>xcode<span class=\"token operator\">-</span>select <span class=\"token operator\">--</span>install\n</code></pre>\n<p>This should prompt you to install the command line tools. Select &quot;Install&quot; to begin the process.</p>\n<p><img src=\"install-dialog.png\" alt=\"install dialog for the command line tools\"></p>\n<p>Don't worry if you get an error about the tools being unavailable from the update server! It seems this happens if you already have the tools installed. If that's the case, you're already done!</p>\n<p><img src=\"install-dialog-server-error.png\" alt=\"server error when installing command line tools\"></p>\n<h2>Testing Your Setup</h2>\n<p>At this point, you should have all you need to build and run OF apps! Let's test it by opening one of the examples that comes with openFrameworks.</p>\n<p>First, extract the folder you downloaded from this website and put it somewhere convenient. This folder will be referred to as your openFrameworks root folder (also known as OF_ROOT). Here's some of the key subfolders inside the openFrameworks root folder:</p>\n<ul>\n<li><strong>apps</strong> will be where your own apps will go as you work on them</li>\n<li><strong>examples</strong> contains a set of pre-made apps that demonstrate specific concepts like dealing with video, 3d graphics, sound, fonts and so on</li>\n<li><strong>addons</strong> is where you can store <a href=\"http://ofxaddons.com/\">openFrameworks addons</a> (community contributed extensions to the openFrameworks core)</li>\n<li><strong>projectGenerator_osx</strong> contains the project generator, which is useful for creating new openFrameworks apps</li>\n</ul>\n<p>Let's test your setup with the 3DPrimitivesExample. Open the <strong>examples</strong> folder, then the <strong>3d</strong> folder and finally the <strong>3DPrimitivesExample</strong> folder. Inside, you should see 2 folders and a few files.</p>\n<p><img src=\"example-selecting.png\" alt=\"selecting the 3D primitives example\"></p>\n<p>This follows the basic structure of an openFrameworks app.</p>\n<ul>\n<li><strong>src</strong> is typically where your app's source files will go</li>\n<li><strong>bin</strong> is where your finished runnable app will end up, as well as your <strong>data</strong> folder which is for assets like images, sound files, etc.</li>\n</ul>\n<p>The file with the <code><span class=\"token punctuation\">.</span>xcodeproj</code> extension is the file you should open in Xcode. Open it now and you should see something similar to the following. You may need to expand the project in the left bar and drill down to the <code>ofApp<span class=\"token punctuation\">.</span>cpp</code> file as shown in the image below in order to see anything interesting.</p>\n<p>As of this writing Xcode is on version 6, so you may see something slightly different if you live in the future.</p>\n<p><img src=\"example-open.png\" alt=\"xcode showing an openframeworks example\"></p>\n<p>The bar on the left is your general purpose project browser, which will show your project's files (if the folder icon is selected at the top), as well as errors that crop up while trying to build your app (the triangular icon).\nHandy tip for working on small screens: cmd-0 will show or hide this sidebar. cmd-1, cmd-2, etc will show different tabs.</p>\n<p>In the middle is your main editor. It will show you an appropriate editor for whatever file you've selected in the project browser. This is usually a text editor for source files (<code><span class=\"token punctuation\">.</span>cpp</code> and <code><span class=\"token punctuation\">.</span>h</code> files), but will show you your project's settings if you select the project file at the top, or will let you examine image / video / sound files as well.</p>\n<p>On the right is an auxilliary sidebar which is almost always useless for openFrameworks. You can hide it by clicking the blue sidebar icon in the top right, or with cmd-option-0.</p>\n<p>Along the top is a toolbar which has the big &quot;run&quot; button (which looks like a play button as of this writing), as well as a dialog which shows you which project you'll build when you tell Xcode to run (called a &quot;scheme&quot; in Xcode terminology).</p>\n<p><strong>It is often the case that the wrong scheme is selected by default</strong>. Xcode has a tendancy to select the &quot;openFrameworks&quot; scheme instead of the one you actually want (which is your app). Select the dropdown in the top which says &quot;openFrameworks&quot; and set it to your app's name. If you find that you try to run your app and nothing happens, this is almost always the reason.</p>\n<p><img src=\"example-scheme.gif\" alt=\"selecting the correct scheme in xcode\"></p>\n<p>After you've selected the right scheme, you should be ready to go! Click the run button at the top left (or use cmd-r) to tell Xcode to build and run the example.</p>\n<p>The first time you compile an openFrameworks project, it will likely take a minute or so as openFrameworks gets compiled. This usually only needs to be done once, unless you update openFrameworks or edit any of its internal files. After openFrameworks itself is finished, Xcode will compile the example and you should see a &quot;Build Succeeded&quot; message and a window with the example app happily spinning away.</p>\n<p><img src=\"example-running.png\" alt=\"example running in a window in front of xcode\"></p>\n<p>After closing the example, you may see a new panel open at the bottom of the Xcode window. This is the console where <code>ofLog</code> messages will show up, as well as another panel which is used for debugging. You can show and hide this panel with cmd-shift-y.</p>\n<p>It is typical for there to be some warnings generated when openFrameworks is compiled. This is unfortunate, but perfectly normal.</p>\n<h2>Generating a New Project</h2>\n<p>Now that you've verified your setup, it's a good time to start a new project from scratch. In the <strong>projectGenerator_osx</strong> folder, you'll find <code>projectGenerator<span class=\"token punctuation\">.</span>app</code> which will make it easy to create new openFrameworks apps. Create a new sketch called firstSketch with all of the default settings and click the generate button.</p>\n<p>Afterwards, close the project generator and navigate to the <strong>apps/myApps/firstSketch</strong> folder. Open <code>firstSketch<span class=\"token punctuation\">.</span>xcodeproj</code> in Xcode, expand the project in the browser on the left, expand the <strong>src</strong> folder and select the <code>ofApp<span class=\"token punctuation\">.</span>cpp</code> file.</p>\n<p>You should now be looking at the blank app template, with empty <code><span class=\"token function\">setup</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span></code>, <code><span class=\"token function\">update</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span></code> and <code><span class=\"token function\">draw</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span></code> functions (as well as many other empty functions).</p>\n<p><img src=\"generate-blank.png\" alt=\"blank openframeworks project template\"></p>\n<p>Let's make a simple app which draws some text in the top left corner of the window. In the <code><span class=\"token function\">draw</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span></code> function, add the following code then hit cmd-r (or click the run button) to run your new app:</p>\n<pre><code><span class=\"token function\">ofDrawBitmapStringHighlight</span><span class=\"token punctuation\">(</span><span class=\"token operator\">&amp;</span>quot<span class=\"token punctuation\">;</span>Everything works<span class=\"token operator\">!</span><span class=\"token operator\">&amp;</span>quot<span class=\"token punctuation\">;</span><span class=\"token punctuation\">,</span> <span class=\"token number\">20</span><span class=\"token punctuation\">,</span> <span class=\"token number\">20</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span>\n</code></pre>\n<p><img src=\"generate-text.gif\" alt=\"filling in the draw function while showing xcode autocomplete\"></p>\n<p>As you're typing, you should see Xcode suggesting autocompletions for you based on what you've already typed. You can hit the up or down arrows to pick a completion, enter to commit it, and use shift to select the placeholder tokens for each of the arguments (the two 20s and the &quot;Everything works!&quot; message).</p>\n<p>If you're not seeing autocomplete, this may be because you need to do a quick build first to get Xcode up to speed. Hit cmd-b to do a build without running the app.</p>\n<h2>Errors and Debugging</h2>\n<p>Inevitably you will run into errors. There are two major kinds, compilation errors and runtime errors. Compilation errors are usually ones caused by typos or bad build settings, and they keep your app from being compiled at all. Runtime errors are errors you get after the app has launched and have scary all-caps names like <code>EXC_BAD_ACCESS</code> and <code>SIGSEGV</code>.</p>\n<p>Compilation errors caused by typos can usually be traced down to a specific line, or a specific character if you're lucky. Xcode will highlight the line red and give you a little triangle under the character it thinks is the issue. In the following example, there are too many &quot;+&quot; characters in the for loop.</p>\n<p><img src=\"errors-compilation.png\" alt=\"compilation error in xcode\"></p>\n<p>Xcode will also attempt to trace runtime errors down to a specific line, but this is a bit more finicky. It's often correct, but if you find Xcode pointing to some file you never wrote, it may just be confused. In the following example, Xcode is correctly identifying the line is causing the app to crash (trying to use a bad pointer).</p>\n<p><img src=\"errors-runtime.png\" alt=\"runtime error in xcode\"></p>\n<p>If the line Xcode is pointing to doesn't seem to be the actual problem, try selecting different stack frames in the sidebar on the left (the numbered list of items).</p>\n<p>Runtime errors are usually caused by variables that get into a state you didn't expect (like an <code><span class=\"token keyword\">int</span></code> getting bigger than you thought it would, or a pointer going <code><span class=\"token constant\">NULL</span></code> when you didn't think that would be possible). Xcode includes a pretty handy debugger that can be useful for stopping your app from running on certain lines, so you can poke around and see what all the variables are at that point in time.</p>\n<p>You can set a breakpoint on any line you want by clicking on the little gutter that runs along the left side of the text editor. It will be represented by a blue arrow, and you can remove it by dragging it off the gutter.</p>\n<p><img src=\"errors-breakpoint.gif\" alt=\"setting breakpoints\"></p>\n<p>Whenever your app hits a breakpoint, it'll pause and show you the current state of all of the variables in the debugging pane at the bottom of the Xcode window. In this screenshot, you can see the final values of the <code>a</code> and <code>b</code> variables after the for loop has finished.</p>\n<p><img src=\"errors-breakpoint-triggered.png\" alt=\"triggering breakpoints\"></p>\n<p>One more use for breakpoints is that they can be set to only trigger under certain conditions. In the following gif, the breakpoint is set to trigger once <code>a</code> is equal to 50.</p>\n<p><img src=\"errors-condition.gif\" alt=\"conditional breakpoint being triggered\"></p>\n<p>Fun fact: instead of having Xcode pause your app when a breakpoint gets hit, you can have it just play a sound instead.</p>\n<h2>Adding Files to Your Project (Addons, etc)</h2>\n<p>As your project grows, you'll probably want to start adding new files. These files might be ones written specifically for your project, or they could be addons or external libraries other people have written.</p>\n<p>Making new files can be done in a few ways. One is to right click your &quot;src&quot; folder in Xcode, and select &quot;New File..&quot;, the other is to go to the menu and select File &gt; New &gt; File...</p>\n<p>In the dialog that pops up, navigate to OS X &gt; Source and then select C++ file. Xcode will create a <code><span class=\"token punctuation\">.</span>cpp</code> and <code><span class=\"token punctuation\">.</span>h</code> pair for you automatically, so just give it a base name (&quot;myNewClass&quot;) and let it do the rest. Make sure you tell Xcode to place the new files in your &quot;src&quot; folder when prompted.</p>\n<p>Adding openFrameworks addons can be a bit complex, but there are some relatively foolproof ways of approaching it. If an addon comes with a README, this will typically have instructions for you regarding how to add the addon to your project. If not, a good approach is to:</p>\n<ul>\n<li>Put the addon in the <strong>addons</strong> folder in your openFrameworks root folder</li>\n<li>Right click the <strong>addons</strong> folder in your project in Xcode</li>\n<li>Select &quot;Add file to (name of your project)...&quot;</li>\n<li>Navigate to the folder where your addon is, and then into the addon itself</li>\n<li>Select the <strong>src</strong> folder, and the <strong>libs</strong> folder (not all addons will have a <strong>libs</strong> folder)</li>\n<li>Use the settings shown in the screenshot below (&quot;create groups&quot; and check all the target boxes, copying is up to you but is not necessary)</li>\n</ul>\n<p><img src=\"files-addons.png\" alt=\"adding src and libs folders for an addon\"></p>\n<ul>\n<li>Click &quot;Add&quot;</li>\n<li>Select the folders you just added in your Xcode project, right click and &quot;New Group from Selection&quot;</li>\n<li>Rename the new group to whatever the addon's name is</li>\n</ul>\n<p><img src=\"files-new-group.gif\" alt=\"renaming addon group\"></p>\n<p>At this point, you should try to build your project. If it succeeds, hooray you're done! If you get errors about &quot;file not found&quot;, you'll probably need to add some of the addon's folders to your header search path. These folders are almost always called &quot;include&quot;, so look for them in the project's <strong>src</strong> and <strong>libs</strong> folders.</p>\n<p><img src=\"files-include-folder.png\" alt=\"finding the include folder in ofxjson\"></p>\n<p>Once you know this path, open up your project's build settings by selecting the project file in the left sidebar in Xcode, selecting the &quot;Build Settings&quot; tab at the top and searching for &quot;header search paths&quot;.</p>\n<p><img src=\"files-finding-build-settings.gif\" alt=\"finding the build settings dialog\"></p>\n<p>Once you've found the appropriate build setting, double click it to edit, click the + button to add a new path and enter the path to the addon's &quot;include&quot; folder. In these settings, <code>$<span class=\"token punctuation\">(</span>OF_PATH<span class=\"token punctuation\">)</span></code> will become the path to the openFrameworks root folder, so you don't need to worry about that part.</p>\n<p><img src=\"files-adding-header-path.gif\" alt=\"adding a header search path to a project\"></p>\n<p>You may have to repeat this process if an addon or library has several <strong>include</strong> folders to add.</p>\n","raw":"## -*- coding: utf-8 -*-\n.. title: xcode\n\nXcode Setup Guide\n==================\n\nFirst Steps\n----------\n\n1. Install Xcode from the [OSX App Store](https://itunes.apple.com/ca/app/xcode/id497799835?mt=12)\n2. Install Xcode's command line tools\n\nTo install the command line tools, first finish installing Xcode then open up a terminal (you can find it at Applications/Utilities/Terminal.app), type the following and hit enter:\n\n```\nxcode-select --install\n```\n\nThis should prompt you to install the command line tools. Select \"Install\" to begin the process.\n\n![install dialog for the command line tools](install-dialog.png)\n\nDon't worry if you get an error about the tools being unavailable from the update server! It seems this happens if you already have the tools installed. If that's the case, you're already done!\n\n![server error when installing command line tools](install-dialog-server-error.png) \n\nTesting Your Setup\n------------------\n\nAt this point, you should have all you need to build and run OF apps! Let's test it by opening one of the examples that comes with openFrameworks.\n\nFirst, extract the folder you downloaded from this website and put it somewhere convenient. This folder will be referred to as your openFrameworks root folder (also known as OF_ROOT). Here's some of the key subfolders inside the openFrameworks root folder:\n\n- **apps** will be where your own apps will go as you work on them\n- **examples** contains a set of pre-made apps that demonstrate specific concepts like dealing with video, 3d graphics, sound, fonts and so on\n- **addons** is where you can store [openFrameworks addons](http://ofxaddons.com/) (community contributed extensions to the openFrameworks core)\n- **projectGenerator_osx** contains the project generator, which is useful for creating new openFrameworks apps\n\nLet's test your setup with the 3DPrimitivesExample. Open the **examples** folder, then the **3d** folder and finally the **3DPrimitivesExample** folder. Inside, you should see 2 folders and a few files.\n\n![selecting the 3D primitives example](example-selecting.png)\n\nThis follows the basic structure of an openFrameworks app.\n\n- **src** is typically where your app's source files will go\n- **bin** is where your finished runnable app will end up, as well as your **data** folder which is for assets like images, sound files, etc.\n\nThe file with the `.xcodeproj` extension is the file you should open in Xcode. Open it now and you should see something similar to the following. You may need to expand the project in the left bar and drill down to the `ofApp.cpp` file as shown in the image below in order to see anything interesting.\n\nAs of this writing Xcode is on version 6, so you may see something slightly different if you live in the future.\n\n![xcode showing an openframeworks example](example-open.png)\n\nThe bar on the left is your general purpose project browser, which will show your project's files (if the folder icon is selected at the top), as well as errors that crop up while trying to build your app (the triangular icon).\nHandy tip for working on small screens: cmd-0 will show or hide this sidebar. cmd-1, cmd-2, etc will show different tabs.\n\nIn the middle is your main editor. It will show you an appropriate editor for whatever file you've selected in the project browser. This is usually a text editor for source files (`.cpp` and `.h` files), but will show you your project's settings if you select the project file at the top, or will let you examine image / video / sound files as well.\n\nOn the right is an auxilliary sidebar which is almost always useless for openFrameworks. You can hide it by clicking the blue sidebar icon in the top right, or with cmd-option-0.\n\nAlong the top is a toolbar which has the big \"run\" button (which looks like a play button as of this writing), as well as a dialog which shows you which project you'll build when you tell Xcode to run (called a \"scheme\" in Xcode terminology).\n\n**It is often the case that the wrong scheme is selected by default**. Xcode has a tendancy to select the \"openFrameworks\" scheme instead of the one you actually want (which is your app). Select the dropdown in the top which says \"openFrameworks\" and set it to your app's name. If you find that you try to run your app and nothing happens, this is almost always the reason.\n\n![selecting the correct scheme in xcode](example-scheme.gif)\n\nAfter you've selected the right scheme, you should be ready to go! Click the run button at the top left (or use cmd-r) to tell Xcode to build and run the example.\n\nThe first time you compile an openFrameworks project, it will likely take a minute or so as openFrameworks gets compiled. This usually only needs to be done once, unless you update openFrameworks or edit any of its internal files. After openFrameworks itself is finished, Xcode will compile the example and you should see a \"Build Succeeded\" message and a window with the example app happily spinning away.\n\n![example running in a window in front of xcode](example-running.png)\n\nAfter closing the example, you may see a new panel open at the bottom of the Xcode window. This is the console where `ofLog` messages will show up, as well as another panel which is used for debugging. You can show and hide this panel with cmd-shift-y.\n\nIt is typical for there to be some warnings generated when openFrameworks is compiled. This is unfortunate, but perfectly normal.\n\nGenerating a New Project\n------------------------\n\nNow that you've verified your setup, it's a good time to start a new project from scratch. In the **projectGenerator_osx** folder, you'll find `projectGenerator.app` which will make it easy to create new openFrameworks apps. Create a new sketch called firstSketch with all of the default settings and click the generate button.\n\nAfterwards, close the project generator and navigate to the **apps/myApps/firstSketch** folder. Open `firstSketch.xcodeproj` in Xcode, expand the project in the browser on the left, expand the **src** folder and select the `ofApp.cpp` file.\n\nYou should now be looking at the blank app template, with empty `setup()`, `update()` and `draw()` functions (as well as many other empty functions).\n\n![blank openframeworks project template](generate-blank.png)\n\nLet's make a simple app which draws some text in the top left corner of the window. In the `draw()` function, add the following code then hit cmd-r (or click the run button) to run your new app:\n\n```\nofDrawBitmapStringHighlight(\"Everything works!\", 20, 20);\n```\n\n![filling in the draw function while showing xcode autocomplete](generate-text.gif)\n\nAs you're typing, you should see Xcode suggesting autocompletions for you based on what you've already typed. You can hit the up or down arrows to pick a completion, enter to commit it, and use shift to select the placeholder tokens for each of the arguments (the two 20s and the \"Everything works!\" message).\n\nIf you're not seeing autocomplete, this may be because you need to do a quick build first to get Xcode up to speed. Hit cmd-b to do a build without running the app.\n\nErrors and Debugging\n--------------------\n\nInevitably you will run into errors. There are two major kinds, compilation errors and runtime errors. Compilation errors are usually ones caused by typos or bad build settings, and they keep your app from being compiled at all. Runtime errors are errors you get after the app has launched and have scary all-caps names like `EXC_BAD_ACCESS` and `SIGSEGV`.\n\nCompilation errors caused by typos can usually be traced down to a specific line, or a specific character if you're lucky. Xcode will highlight the line red and give you a little triangle under the character it thinks is the issue. In the following example, there are too many \"+\" characters in the for loop.\n\n![compilation error in xcode](errors-compilation.png)\n\nXcode will also attempt to trace runtime errors down to a specific line, but this is a bit more finicky. It's often correct, but if you find Xcode pointing to some file you never wrote, it may just be confused. In the following example, Xcode is correctly identifying the line is causing the app to crash (trying to use a bad pointer).\n\n![runtime error in xcode](errors-runtime.png)\n\nIf the line Xcode is pointing to doesn't seem to be the actual problem, try selecting different stack frames in the sidebar on the left (the numbered list of items).\n\nRuntime errors are usually caused by variables that get into a state you didn't expect (like an `int` getting bigger than you thought it would, or a pointer going `NULL` when you didn't think that would be possible). Xcode includes a pretty handy debugger that can be useful for stopping your app from running on certain lines, so you can poke around and see what all the variables are at that point in time.\n\nYou can set a breakpoint on any line you want by clicking on the little gutter that runs along the left side of the text editor. It will be represented by a blue arrow, and you can remove it by dragging it off the gutter.\n\n![setting breakpoints](errors-breakpoint.gif)\n\nWhenever your app hits a breakpoint, it'll pause and show you the current state of all of the variables in the debugging pane at the bottom of the Xcode window. In this screenshot, you can see the final values of the `a` and `b` variables after the for loop has finished. \n\n![triggering breakpoints](errors-breakpoint-triggered.png)\n\nOne more use for breakpoints is that they can be set to only trigger under certain conditions. In the following gif, the breakpoint is set to trigger once `a` is equal to 50.\n\n![conditional breakpoint being triggered](errors-condition.gif)\n\nFun fact: instead of having Xcode pause your app when a breakpoint gets hit, you can have it just play a sound instead.\n\nAdding Files to Your Project (Addons, etc)\n---------------------------------------------\n\nAs your project grows, you'll probably want to start adding new files. These files might be ones written specifically for your project, or they could be addons or external libraries other people have written.\n\nMaking new files can be done in a few ways. One is to right click your \"src\" folder in Xcode, and select \"New File..\", the other is to go to the menu and select File > New > File...\n\nIn the dialog that pops up, navigate to OS X > Source and then select C++ file. Xcode will create a `.cpp` and `.h` pair for you automatically, so just give it a base name (\"myNewClass\") and let it do the rest. Make sure you tell Xcode to place the new files in your \"src\" folder when prompted.\n\nAdding openFrameworks addons can be a bit complex, but there are some relatively foolproof ways of approaching it. If an addon comes with a README, this will typically have instructions for you regarding how to add the addon to your project. If not, a good approach is to:\n\n- Put the addon in the **addons** folder in your openFrameworks root folder\n- Right click the **addons** folder in your project in Xcode\n- Select \"Add file to (name of your project)...\"\n- Navigate to the folder where your addon is, and then into the addon itself\n- Select the **src** folder, and the **libs** folder (not all addons will have a **libs** folder)\n- Use the settings shown in the screenshot below (\"create groups\" and check all the target boxes, copying is up to you but is not necessary)\n\n![adding src and libs folders for an addon](files-addons.png)\n\n- Click \"Add\"\n- Select the folders you just added in your Xcode project, right click and \"New Group from Selection\"\n- Rename the new group to whatever the addon's name is\n\n![renaming addon group](files-new-group.gif)\n\nAt this point, you should try to build your project. If it succeeds, hooray you're done! If you get errors about \"file not found\", you'll probably need to add some of the addon's folders to your header search path. These folders are almost always called \"include\", so look for them in the project's **src** and **libs** folders.\n\n![finding the include folder in ofxjson](files-include-folder.png)\n\nOnce you know this path, open up your project's build settings by selecting the project file in the left sidebar in Xcode, selecting the \"Build Settings\" tab at the top and searching for \"header search paths\". \n\n![finding the build settings dialog](files-finding-build-settings.gif)\n\nOnce you've found the appropriate build setting, double click it to edit, click the + button to add a new path and enter the path to the addon's \"include\" folder. In these settings, `$(OF_PATH)` will become the path to the openFrameworks root folder, so you don't need to worry about that part.\n\n![adding a header search path to a project](files-adding-header-path.gif)\n\nYou may have to repeat this process if an addon or library has several **include** folders to add.\n\n","type":"page","static":true}}],"fetch":[]}