{"data":[{"page":{"entry":{"name":"introduction","filename":"introduction.markdown","absolute":"/Users/gilbertsinnott/Code/openFrameworks/ofSite/documentation/utils/introduction.markdown","path":"/documentation/utils/introduction","route":"/documentation/utils/introduction.markdown","dir":"../ofSite/documentation/utils","ext":"markdown","type":"page","id":2198,"parent":2196,"breadcrumbs":[2196,1718],"translations":{"ko":{"name":"introduction-ko","filename":"introduction.ko.markdown","absolute":"/Users/gilbertsinnott/Code/openFrameworks/ofSite/documentation/application/introduction.ko.markdown","path":"/documentation/application/introduction-ko","route":"/documentation/application/introduction.ko.markdown","dir":"../ofSite/documentation/application","ext":"markdown","type":"page","id":1898,"parent":1897,"breadcrumbs":[1897,1718],"siblings":[{"name":"introduction-ko","filename":"introduction.ko.markdown","absolute":"/Users/gilbertsinnott/Code/openFrameworks/ofSite/documentation/glm/introduction.ko.markdown","path":"/documentation/glm/introduction-ko","route":"/documentation/glm/introduction.ko.markdown","dir":"../ofSite/documentation/glm","ext":"markdown","type":"page","id":2073,"parent":1985,"breadcrumbs":[1985,1718],"siblings":[],"translations":{}},{"name":"introduction-ko","filename":"introduction.ko.markdown","absolute":"/Users/gilbertsinnott/Code/openFrameworks/ofSite/documentation/graphics/introduction.ko.markdown","path":"/documentation/graphics/introduction-ko","route":"/documentation/graphics/introduction.ko.markdown","dir":"../ofSite/documentation/graphics","ext":"markdown","type":"page","id":2081,"parent":2075,"breadcrumbs":[2075,1718],"siblings":[],"translations":{}}],"translations":{}}},"siblings":[]},"description":{},"document":"<h2>Filesystem, threading, popup windows and other utilities</h2>\n<p>The utils module, has different kinds of utilities the main groups are:</p>\n<p>Filesystem: <a href=\"ofFilePath/\">ofFilePath</a>, <a href=\"ofFile/\">ofFile</a>, <a href=\"ofDirectory/\">ofDirectory</a> give functionalities to work with filesystem paths, open, read, and do different operations over files and directories in the computer.</p>\n<p><a href=\"ofSystemUtils\">ofSystemUtils</a>: contains mostly functions for creating message and file opening and saving dialogs.</p>\n<p><a href=\"ofURLFileLoader/\">ofURLFileLoader</a>: can be sued to load resources over from the web using the http protocol.</p>\n<p><a href=\"ofXml/\">ofXml</a>: lets you load and save xml files</p>\n<p>Threading: <a href=\"ofThread/\">ofThread</a> allows to create a worker thread that can execute a CPU intensive task in the background so the execution of the application and the graphics output are not interrupted. <a href=\"ofThreadChannel/\">ofThreadChannel</a> is a class that allows to send messages between different threads instead of using shared memory (variables) locked by mutexes or other synchronization primitives which are usually more complex to use and error prone.</p>\n<p><a href=\"ofUTF8Iterator/\">ofUTF8Iterator</a> makes it easy to parse std::strings encoded in the most common unicode format, UTF-8.</p>\n<p><a href=\"ofFpsCounter/\">ofFpsCounter</a> counts the fps of anything that returns data or somehow happens periodically in a really simple and accurate way. It's used internally by openFrameworks to meassure the fps of the application but can be used to meassure the fps of anything else, like a camera or anything that happens with a certain frequency.</p>\n<p><a href=\"ofBuffer\">ofBuffer</a> Can hold a whole file (text or binary) or any other buffer in memory and has utilities to easily iterate over it's contents. Also classes like <a href=\"ofFile/\">ofFile</a> can return it's contents in an easy manner using this class.</p>\n<p><a href=\"ofUtils\">ofUtils</a> Contains different functions for varied purposes, from string manipulation like ofToUpper or ofSplitString to time functions like ofGetSeconds or ofGetMinutes.</p>\n","raw":"## Filesystem, threading, popup windows and other utilities\n\nThe utils module, has different kinds of utilities the main groups are:\n\nFilesystem: [ofFilePath](ofFilePath/), [ofFile](ofFile/), [ofDirectory](ofDirectory/) give functionalities to work with filesystem paths, open, read, and do different operations over files and directories in the computer.\n\n[ofSystemUtils](ofSystemUtils): contains mostly functions for creating message and file opening and saving dialogs.\n\n[ofURLFileLoader](ofURLFileLoader/): can be sued to load resources over from the web using the http protocol.\n\n[ofXml](ofXml/): lets you load and save xml files\n\nThreading: [ofThread](ofThread/) allows to create a worker thread that can execute a CPU intensive task in the background so the execution of the application and the graphics output are not interrupted. [ofThreadChannel](ofThreadChannel/) is a class that allows to send messages between different threads instead of using shared memory (variables) locked by mutexes or other synchronization primitives which are usually more complex to use and error prone.\n\n[ofUTF8Iterator](ofUTF8Iterator/) makes it easy to parse std::strings encoded in the most common unicode format, UTF-8.\n\n[ofFpsCounter](ofFpsCounter/) counts the fps of anything that returns data or somehow happens periodically in a really simple and accurate way. It's used internally by openFrameworks to meassure the fps of the application but can be used to meassure the fps of anything else, like a camera or anything that happens with a certain frequency.\n\n[ofBuffer](ofBuffer) Can hold a whole file (text or binary) or any other buffer in memory and has utilities to easily iterate over it's contents. Also classes like [ofFile](ofFile/) can return it's contents in an easy manner using this class.\n\n[ofUtils](ofUtils) Contains different functions for varied purposes, from string manipulation like ofToUpper or ofSplitString to time functions like ofGetSeconds or ofGetMinutes.\n","type":"page","static":true}}],"fetch":[]}