{"entry":{"name":"introduction","filename":"introduction.markdown","absolute":"/Users/Gilbert/Code/openFrameworks/ofSite/documentation/graphics/introduction.markdown","path":"/documentation/graphics/introduction","route":"/documentation/graphics/introduction.markdown","dir":"../ofSite/documentation/graphics","ext":"markdown","type":"page","id":365,"parent":358,"breadcrumbs":[358,1],"translations":{"ko":{"name":"introduction-ko","filename":"introduction.ko.markdown","absolute":"/Users/Gilbert/Code/openFrameworks/ofSite/documentation/application/introduction.ko.markdown","path":"/documentation/application/introduction-ko","route":"/documentation/application/introduction.ko.markdown","dir":"../ofSite/documentation/application","ext":"markdown","type":"page","id":181,"parent":180,"breadcrumbs":[180,1],"siblings":[{"name":"introduction-ko","filename":"introduction.ko.markdown","absolute":"/Users/Gilbert/Code/openFrameworks/ofSite/documentation/glm/introduction.ko.markdown","path":"/documentation/glm/introduction-ko","route":"/documentation/glm/introduction.ko.markdown","dir":"../ofSite/documentation/glm","ext":"markdown","type":"page","id":356,"parent":268,"breadcrumbs":[268,1],"siblings":[],"translations":{}},{"name":"introduction-ko","filename":"introduction.ko.markdown","absolute":"/Users/Gilbert/Code/openFrameworks/ofSite/documentation/graphics/introduction.ko.markdown","path":"/documentation/graphics/introduction-ko","route":"/documentation/graphics/introduction.ko.markdown","dir":"../ofSite/documentation/graphics","ext":"markdown","type":"page","id":364,"parent":358,"breadcrumbs":[358,1],"siblings":[],"translations":{}}],"translations":{}}},"siblings":[]},"description":{},"document":"<h2>2D graphics, images and typography</h2>\n<p>This module contains classes and functions that allow to work with 2d graphics, including drawing 2d shapes, using images both drawing them using the graphics card or manipulate their contents in the computer's memory, and typography.</p>\n<p>The most important classes in this module are:</p>\n<ul>\n<li>\n<p><a href=\"ofImage/\">ofImage</a>: allows to load, save and draw images in lots of different image formats, it holds an <a href=\"../gl/ofTexture/\">ofTexture</a> which allows to draw the image through the graphics card and an <a href=\"ofPixels/\">ofPixels</a> which is also part of this module and contains the pixel information of the image allowing also to do basic transformations on them like cropping, resizing, scaling, iterating through the pixel data...</p>\n</li>\n<li>\n<p><a href=\"ofPolyline/\">ofPolyline</a>: represents a polyline or polygon and allows to do some operations over them. Although it allows to draw the outline of the data it contains, this class is better used to manipulate polylines and it's used by <a href=\"ofPath/\">ofPath</a> to create complex shapes and draw outlines.</p>\n</li>\n<li>\n<p><a href=\"ofPath/\">ofPath</a>: represents a complex shape formed by one or more outlines, internally it uses <a href=\"ofPolyline/\">ofPolyline</a> to represent that data and later decomposes it in <a href=\"../3d/ofMesh/\">ofMesh</a> if necesary. It can draw both contours and filled shapes and it's the recommended way to draw 2d shapes in openFrameworks.</p>\n</li>\n<li>\n<p><a href=\"ofTrueTypeFont/\">ofTrueTypeFont</a>: can load true type fonts in different formats and draw text using the loaded font.</p>\n</li>\n<li>\n<p><a href=\"ofGraphics/\">ofGraphics</a>: has several utility functions to change the state of the graphics pipeline (like the default color or the blending mode) and allows to draw shapes in immediate mode which can be useful if you want to draw something quickly, for prototipying, instead of using ofPath</p>\n</li>\n</ul>\n<p>The rest of the classes in this module are usually utility classes used by openFrameworks itself to provide the 2d drawing functionality and although they can be useful in some cases in applicaiton code, they are usually not used directly by applications. For example ofBitmapFont is a class that allows openFrameworks to draw a text using a default bitmap font without having to load a TTF file but in order to draw from application code we usually use the <code>ofDrawBitmapString</code> function present in <a href=\"ofGraphics/\">ofGraphics</a>. Or ofCairoRenderer allows OF to draw to a PDF or SVG among other things but it can be easily used through the corresponding functions in <a href=\"ofGraphics/\">ofGraphics</a></p>\n","raw":"## 2D graphics, images and typography\n\nThis module contains classes and functions that allow to work with 2d graphics, including drawing 2d shapes, using images both drawing them using the graphics card or manipulate their contents in the computer's memory, and typography.\n\nThe most important classes in this module are:\n\n- [ofImage](ofImage/): allows to load, save and draw images in lots of different image formats, it holds an [ofTexture](../gl/ofTexture/) which allows to draw the image through the graphics card and an [ofPixels](ofPixels/) which is also part of this module and contains the pixel information of the image allowing also to do basic transformations on them like cropping, resizing, scaling, iterating through the pixel data...\n\n- [ofPolyline](ofPolyline/): represents a polyline or polygon and allows to do some operations over them. Although it allows to draw the outline of the data it contains, this class is better used to manipulate polylines and it's used by [ofPath](ofPath/) to create complex shapes and draw outlines.\n\n- [ofPath](ofPath/): represents a complex shape formed by one or more outlines, internally it uses [ofPolyline](ofPolyline/) to represent that data and later decomposes it in [ofMesh](../3d/ofMesh/) if necesary. It can draw both contours and filled shapes and it's the recommended way to draw 2d shapes in openFrameworks.\n\n- [ofTrueTypeFont](ofTrueTypeFont/): can load true type fonts in different formats and draw text using the loaded font.\n\n- [ofGraphics](ofGraphics/): has several utility functions to change the state of the graphics pipeline (like the default color or the blending mode) and allows to draw shapes in immediate mode which can be useful if you want to draw something quickly, for prototipying, instead of using ofPath\n\nThe rest of the classes in this module are usually utility classes used by openFrameworks itself to provide the 2d drawing functionality and although they can be useful in some cases in applicaiton code, they are usually not used directly by applications. For example ofBitmapFont is a class that allows openFrameworks to draw a text using a default bitmap font without having to load a TTF file but in order to draw from application code we usually use the `ofDrawBitmapString` function present in [ofGraphics](ofGraphics/). Or ofCairoRenderer allows OF to draw to a PDF or SVG among other things but it can be easily used through the corresponding functions in [ofGraphics](ofGraphics/)\n","type":"page"}